
{
  "lessons": [
    {
      "title": "Module 1: Introduction to Money & Finance",
      "description": "Week 1: What is Money? Why do we need it? Pocket Money vs. Income",
      "is_free": true,
      "order_index": 1,
      "subtopics": [
        {
          "title": "Day 1: What is Money?",
          "content": "<h1>What is Money?</h1><h2>Topic Overview</h2><ul><li><strong>Definition:</strong> Money is anything widely accepted as payment for goods, services, and debt.</li><li><strong>Functions:</strong> It's a medium of exchange, a unit of account, and a store of value.</li><li><strong>History:</strong> Before money, people bartered goods directly (e.g., trading wheat for shoes).</li></ul><h2>Explanation</h2><p><strong>Medium of Exchange:</strong> Money replaces barter, making our daily trade easier and more flexible.</p><p><strong>Unit of Account:</strong> Prices are expressed in money, helping everyone compare value clearly.</p><p><strong>Store of Value:</strong> We can save money for future purchases.</p><h3>Why Not Barter?</h3><p>Imagine needing a pair of shoes but only having wheat to trade—the shoemaker may not want wheat! Money solves such problems.</p><h2>Key Takeaways</h2><ul><li>Money is crucial for trade and specialization.</li><li>It simplifies exchanges and boosts prosperity.</li><li>Modern money includes cash, coins, and digital money.</li></ul>",
          "order_index": 1,
          "practice_question": "What problem does money solve in bartering?",
          "practice_type": "text",
          "correct_answer": "The double coincidence of wants: finding someone who wants what you have and offers what you want."
        },
        {
          "title": "Day 2: Why Do We Need Money?",
          "content": "<h1>Why Do We Need Money?</h1><h2>Topic Overview</h2><ul><li><strong>Facilitates trade:</strong> Money makes trading possible and easy.</li><li><strong>Builds trust:</strong> Allows transactions even among strangers.</li><li><strong>Helps specialization:</strong> People can focus on one skill/trade.</li></ul><h2>Explanation</h2><p><strong>Trade:</strong> Money lets us buy what we need, when we need it, from anyone.</p><p><strong>Trust Factor:</strong> Unlike barter, money doesn’t rely on knowing or trusting the other person.</p><p><strong>Specialization:</strong> E.g., a tailor doesn’t need to want fish; money lets them sell clothes and buy fish from someone else.</p><h2>Key Takeaways</h2><ul><li>Money increases prosperity and social cooperation.</li><li>Trust in money keeps the system working.</li><li>Specialization is possible thanks to money.</li></ul>",
          "order_index": 2,
          "practice_question": "True or False: Money is useful only for buying things.",
          "practice_type": "mcq",
          "practice_options": ["True", "False"],
          "correct_answer": "False"
        },
        {
          "title": "Day 3: Pocket Money — What Is It?",
          "content": "<h1>Pocket Money — What Is It?</h1><h2>Topic Overview</h2><ul><li><strong>Definition:</strong> Pocket money is money given regularly by parents/caregivers for small personal expenses.</li><li><strong>Purpose:</strong> Teaches budgeting, independence, and basic money management.</li><li><strong>Limitations:</strong> Usually limited in amount and comes with recommended use.</li></ul><h2>Explanation</h2><p><strong>Practice Economy:</strong> Teens learn to negotiate spending with a fixed budget.</p><p><strong>Safe Introduction:</strong> Mistakes are small, letting teens learn without major risks.</p><p><strong>Varies:</strong> Some get pocket money for chores; some as regular allowance.</p><h2>Key Takeaways</h2><ul><li>Pocket money is a learning tool.</li><li>It’s for discretionary spending, not essentials.</li><li>The amount and frequency vary by family and culture.</li></ul>",
          "order_index": 3,
          "practice_question": "Why do parents give pocket money?",
          "practice_type": "text",
          "correct_answer": "To teach budgeting and small-scale financial responsibility."
        },
        {
          "title": "Day 4: Income — Beyond Pocket Money",
          "content": "<h1>Income — Beyond Pocket Money</h1><h2>Topic Overview</h2><ul><li><strong>Definition:</strong> Income is money earned through work, business, or investments.</li><li><strong>Types:</strong> Active (like salary, part-time job) and passive (gifts, interest).</li><li><strong>Values earned income:</strong> Creates sense of achievement, responsibility.</li></ul><h2>Explanation</h2><p><strong>Earned Money:</strong> Teens may earn through part-time jobs, tutoring, or creative work.</p><p><strong>Difference from pocket money:</strong> Income is earned, pocket money is given.</p><p><strong>Responsibility:</strong> More freedom, but also bigger decisions and real consequences.</p><h2>Key Takeaways</h2><ul><li>Income typically requires effort or skills.</li><li>It teaches real-life financial principles.</li><li>Earned money feels more valuable than given.</li></ul>",
          "order_index": 4,
          "practice_question": "What’s the main difference between pocket money and income?",
          "practice_type": "text",
          "correct_answer": "Pocket money is given; income is earned through active contribution or work."
        },
        {
          "title": "Day 5: Comparing Pocket Money & Income",
          "content": "<h1>Comparing Pocket Money & Income</h1><h2>Topic Overview</h2><ul><li><strong>Training vs. Real Life:</strong> Pocket money is for practice; income is for real financial independence.</li><li><strong>How it feels:</strong> Earned money is usually valued more.</li><li><strong>Choices:</strong> Income offers bigger opportunities and responsibilities.</li></ul><h2>Explanation</h2><p><strong>Budgeting:</strong> As teens start earning, they must budget differently.</p><p><strong>Value seen:</strong> Most teens spend pocket money quickly, but save earned money for bigger goals.</p><p><strong>Accountability:</strong> Mistakes with income have real consequences.</p><h2>Key Takeaways</h2><ul><li>Both types are valuable for learning, but income carries more meaning.</li><li>Budgeting changes as income increases.</li><li>Teens should try both for balanced experience.</li></ul>",
          "order_index": 5,
          "practice_question": "True or False: Receiving only pocket money prepares you for adulthood fully.",
          "practice_type": "mcq",
          "practice_options": ["True", "False"],
          "correct_answer": "False"
        },
        {
          "title": "Day 6: Money Management Skills",
          "content": "<h1>Money Management Skills</h1><h2>Topic Overview</h2><ul><li><strong>Budgeting:</strong> Tracking income and expenses.</li><li><strong>Saving:</strong> Setting aside money for future needs/wants.</li><li><strong>Decision Making:</strong> Prioritizing choices.</li></ul><h2>Explanation</h2><p><strong>Record keeping:</strong> Write down all income (pocket money, earnings) and expenses.</p><p><strong>Setting goals:</strong> Make savings plans for short/long-term goals.</p><p><strong>Making comparisons:</strong> Weigh needs versus wants.</p><h2>Key Takeaways</h2><ul><li>Good habits start early—record, save, spend wisely.</li><li>Practice makes confident financial decisions.</li></ul>",
          "order_index": 6,
          "practice_question": "Track your pocket money, income, and expenses for one week. What did you learn?",
          "practice_type": "text",
          "correct_answer": "Answers will vary, but should reflect on spending/saving habits."
        },
        {
          "title": "Day 7: Summary & Challenge",
          "content": "<h1>Summary & Challenge</h1><h2>Topic Overview</h2><ul><li><strong>Review:</strong> What is money? Why do we need it? Pocket money vs. income.</li><li>Develop your money mission statement.</li><li>Prepare for next week's module!</li></ul><h2>Activities</h2><ul><li><strong>Summary Exercise:</strong> Write a paragraph on what you learned about money, pocket money, and income.</li><li><strong>Mission Statement:</strong> Create a personal money mission (e.g., “I will value earned income, budget pocket money wisely, and save for future goals.”)</li><li><strong>Group Discussion:</strong> How does understanding money change your choices?</li></ul><h2>Key Takeaways</h2><ul><li>Knowing how money works helps you make smart choices as you grow.</li><li>Practice budgeting, saving, and decision-making.</li><li>Both pocket money and earned income are steps toward financial independence.</li></ul>",
          "order_index": 7,
          "practice_question": "Create your personal money mission statement.",
          "practice_type": "text",
          "correct_answer": "Answers will be personal statements about valuing, budgeting, and saving money."
        }
      ]
    },
    {
      "title": "Module 2: Banking & Digital Payments",
      "description": "Learn the fundamentals of banking, from different account types to modern digital payment methods like UPI and Netbanking.",
      "is_free": false,
      "order_index": 2,
      "subtopics": [
        {
          "title": "Day 1: What is a Bank?",
          "content": "<h1>What is a Bank?</h1><h2>Topic Overview</h2><ul><li>A bank is a safe place to keep money where it grows and can be easily managed.</li><li>Banks help people store money, give loans, offer cards, and process payments.</li><li>Banks serve individuals, companies, and governments.</li></ul><h2>Explanation</h2><p>When you deposit money in a bank, you are lending it to the bank, which pays you interest.</p><p>Examples: Checking balances, withdrawing money, using debit cards, and online payments.</p><p>Your money is more secure in a bank than at home.</p><h2>Key Takeaways</h2><ul><li>Banks help manage money and keep it safe.</li><li>Money in banks can earn interest.</li><li>Banks let you access money anytime, anywhere.</li></ul>",
          "order_index": 1,
          "practice_question": "Why do people use banks?",
          "practice_type": "text",
          "correct_answer": "For safe storage, earning interest, and ease of payments."
        },
        {
          "title": "Day 2: Types of Accounts",
          "content": "<h1>Types of Accounts</h1><h2>Topic Overview</h2><ul><li><strong>Savings Account:</strong> For storing and growing money, earning interest, limited transactions.</li><li><strong>Current Account:</strong> For businesses or frequent transactions, little or no interest.</li></ul><h2>Explanation</h2><p><strong>Savings Account:</strong> Like a smart piggy bank, encourages saving, earns interest, usually needs a minimum balance.</p><p><strong>Current Account:</strong> Like a wallet for businesses—can deposit/withdraw money anytime; mostly for shopkeepers or freelancers.</p><h2>Key Takeaways</h2><ul><li>Most teens start with a savings account to begin saving money.</li><li>Interest earned differs between the two account types.</li><li>Choose the account based on personal needs.</li></ul>",
          "order_index": 2,
          "practice_question": "What is the main benefit of a savings account?",
          "practice_type": "text",
          "correct_answer": "It earns interest."
        },
        {
          "title": "Day 3: UPI – Digital Payments Made Easy",
          "content": "<h1>UPI – Digital Payments Made Easy</h1><h2>Topic Overview</h2><ul><li>UPI (Unified Payments Interface) lets you send money instantly by phone.</li><li>No need for cash or physical cards.</li><li>Safe, fast, works 24/7.</li></ul><h2>Explanation</h2><p>UPI apps (like PhonePe, Google Pay) connect your bank account to your phone.</p><p>You can pay shops, friends, or bills in seconds.</p><p>Parents can set limits or supervise as needed.</p><h2>Key Takeaways</h2><ul><li>UPI is a safe and easy way to pay.</li><li>You need a UPI PIN for every transaction.</li><li>Helps teens learn responsible digital money habits.</li></ul>",
          "order_index": 3,
          "practice_question": "What does UPI stand for?",
          "practice_type": "text",
          "correct_answer": "Unified Payments Interface."
        },
        {
          "title": "Day 4: ATM – Your Cash Machine",
          "content": "<h1>ATM – Your Cash Machine</h1><h2>Topic Overview</h2><ul><li>ATM: Lets you withdraw or deposit money anytime.</li><li>Uses your debit card and a PIN for security.</li></ul><h2>Explanation</h2><p>Insert card, enter PIN, choose withdrawal or balance inquiry.</p><p>Many banks offer up to 3–5 free ATM uses each month.</p><p>Protect your PIN and card like your wallet.</p><h2>Key Takeaways</h2><ul><li>ATMs work all day, every day.</li><li>PIN keeps your ATM transactions secure.</li><li>Never share or write down your PIN.</li></ul>",
          "order_index": 4,
          "practice_question": "What is an ATM?",
          "practice_type": "text",
          "correct_answer": "Automated Teller Machine—a machine to withdraw or deposit money."
        },
        {
          "title": "Day 5: Netbanking – Manage Your Account Online",
          "content": "<h1>Netbanking – Manage Your Account Online</h1><h2>Topic Overview</h2><ul><li>Netbanking: Banking over the internet.</li><li>Check balances, transfer money, pay bills from your computer or phone.</li></ul><h2>Explanation</h2><p>Requires a login ID and password, sometimes OTP.</p><p>Lets you do almost everything: pay bills, transfer money, open deposits.</p><p>Safer than cash if proper steps are followed.</p><h2>Key Takeaways</h2><ul><li>Netbanking is flexible—anytime, anywhere.</li><li>Never share passwords/OTP.</li><li>Use official bank apps/websites only.</li></ul>",
          "order_index": 5,
          "practice_question": "What is an OTP?",
          "practice_type": "text",
          "correct_answer": "One-Time Password, sent to your phone for security."
        }
      ]
    },
    {
      "title": "Module 3: Artificial Intelligence in Real Life",
      "description": "A Complete 7-Day Learning Journey for Teens (Ages 13-16) into AI in finance.",
      "is_free": false,
      "order_index": 3,
      "subtopics": [
        {
          "title": "Day 1: The AI Revolution in Finance",
          "content": "<h1>The AI Revolution in Finance</h1><h2>What is AI Really Doing with Our Money?</h2><h3>Topic Overview</h3><ul><li>AI acts like a digital guardian for your money, protecting bank accounts and detecting fraud 24/7. Over 90% of banks use AI to fight fraud, analyzing billions of transactions every day.</li><li>AI powers apps on your phone that catch suspicious charges and help your family manage money.</li><li>Criminals also use AI, but financial companies use stronger AI, creating a high-tech battle to keep your money safe.</li></ul><h3>Explanation</h3><ul><li>AI gives computers a brain-like power to learn and make decisions.</li><li>It recognizes unusual spending patterns (e.g., a morning latte vs. a $500 pizza at 3 AM far away).</li><li>This all happens instantly, faster than any human could check.</li></ul><h3>Key Takeaways</h3><ul><li>AI is everywhere in finance, quietly working to protect and help manage money.</li><li>Banks use AI to outsmart criminals using AI themselves.</li><li>AI analyzes millions of transactions every second, providing unmatched security.</li><li>You are part of this new financial world where AI is normal!</li></ul>",
          "order_index": 1,
          "practice_question": "What percentage of U.S. banks use AI for fraud detection?",
          "practice_type": "text",
          "correct_answer": "About 90%"
        },
        {
          "title": "Day 2: Machine Learning vs. Deep Learning",
          "content": "<h1>Machine Learning vs. Deep Learning</h1><h2>The Brains Behind the AI Operation</h2><h3>Topic Overview</h3><ul><li>Machine learning is like teaching someone to drive with lots of examples — it learns simple patterns like stopping at red lights.</li><li>Deep learning is like mastering Formula 1 racing — it uses multi-layered 'brain-like' neural networks to learn very complex patterns.</li><li>Financial companies use both: machine learning for simple fraud, deep learning for complex schemes.</li></ul><h3>Explanation</h3><ul><li>Machine learning finds patterns and makes clear predictions (email filters, basic fraud detection).</li><li>Deep learning uses multiple layers to analyze huge amounts of varied info for more sophisticated detection (voice assistants, advanced fraud rings).</li></ul><h3>Key Takeaways</h3><ul><li>Machine learning and deep learning are different AI tools for different problems.</li><li>Machine learning handles clear patterns, deep learning deals with complex data.</li><li>Both are essential in financial fraud detection and AI applications.</li></ul>",
          "order_index": 2,
          "practice_question": "Complete the analogy: Machine learning is to riding a bike as deep learning is to...?",
          "practice_type": "text",
          "correct_answer": "Flying a fighter jet"
        },
        {
          "title": "Day 3: AI Fraud Detection - Your Money’s Bodyguard",
          "content": "<h1>AI Fraud Detection - Your Money’s Bodyguard</h1><h3>Topic Overview</h3><ul><li>AI fraud systems analyze over 10 billion transactions daily in milliseconds.</li><li>91% of US banks use AI to detect fraud with 96% accuracy, reducing false alerts.</li><li>AI learns your unique spending habits (your “financial fingerprint”) and spots fraud fast.</li></ul><h3>Explanation</h3><ul><li>Behavioral analysis monitors usual purchase times, amounts, and merchant types.</li><li>AI detects fraud rings by analyzing links between suspicious transactions.</li><li>Real cases like blocking fake international money wiring demonstrate AI in action.</li></ul><h3>Key Takeaways</h3><ul><li>AI fraud detection is lightning fast and highly accurate.</li><li>AI learns your personal spending style to detect anomalies.</li><li>AI systems constantly improve to keep ahead of criminals.</li></ul>",
          "order_index": 3,
          "practice_question": "Why is AI better than humans at spotting fraud?",
          "practice_type": "text",
          "correct_answer": "Speed, accuracy, and scale."
        },
        {
          "title": "Day 4: AI Trading Bots - Robots in the Stock Market",
          "content": "<h1>AI Trading Bots - Robots in the Stock Market</h1><h3>Topic Overview</h3><ul><li>AI trading bots analyze market data and trade stocks faster than humans (in 0.01 seconds).</li><li>They handle 60-75% of stock market trades globally, but success isn’t guaranteed for all users.</li><li>Bots can provide impressive returns but also have risks like sudden market crashes.</li></ul><h3>Explanation</h3><p>Three stages of trading bots:</p><ol><li>Signal Generation — identify buy/sell opportunities based on patterns.</li><li>Risk Management — decide how much money to use and set safety limits.</li><li>Trade Execution — place trades automatically and adjust to changes.</li></ol><p>Examples include cryptocurrency bots making profits by catching market dips.</p><h3>Key Takeaways</h3><ul><li>Speed and big data give AI trading bots an edge.</li><li>Most users don’t make consistent profits; skill and caution are required.</li><li>Bots reshape the market but new risks also arise.</li></ul>",
          "order_index": 4,
          "practice_question": "What’s a safe approach for beginners using trading bots?",
          "practice_type": "text",
          "correct_answer": "Start small, cautious investing."
        },
        {
          "title": "Day 5: Project Preparation - Choosing Your AI Tool",
          "content": "<h1>Project Preparation - Choosing Your AI Tool</h1><h3>Topic Overview</h3><ul><li>Today you’ll choose an AI tool to analyze spending patterns either your own or simulated.</li><li>Many free or affordable AI-powered apps like Mint, PocketGuard, and Expense AI are great for beginners.</li><li>Your project will turn AI data into real insights and recommendations.</li></ul><h3>Explanation</h3><ul><li>Options include receipt scanning apps, bank-connected tools, or spreadsheet simulations.</li><li>Collect at least 30 transactions with date, amount, merchant info for analysis.</li><li>Look for spending categories, patterns, outliers, and AI budgeting suggestions.</li></ul><h3>Key Takeaways</h3><ul><li>Real financial AI tools are accessible to teenagers.</li><li>Analyzing actual data, even small amounts, uncovers useful insights.</li><li>Always consider privacy and get permission for financial data use.</li></ul>",
          "order_index": 5,
          "practice_question": "Why might free apps still raise privacy concerns?",
          "practice_type": "text",
          "correct_answer": "They may sell data or show ads."
        },
        {
          "title": "Day 6: Project Execution - AI in Action",
          "content": "<h1>Project Execution - AI in Action</h1><h3>Topic Overview</h3><ul><li>Now, use your selected AI tool to upload and analyze your transaction data.</li><li>Explore spending categories, time trends, recurring expenses, and unusual transactions.</li><li>Document your insights and prepare to share your findings.</li></ul><h3>Explanation</h3><ul><li>Review AI categorizations and correct any mistakes to learn AI limits.</li><li>Use AI's predictive and comparison features for future budgeting.</li><li>Note surprising spending habits to understand your financial behavior better.</li></ul><h3>Key Takeaways</h3><ul><li>AI reveals hidden and surprising spending patterns.</li><li>Good data quality means better insights.</li><li>AI suggests but doesn’t decide — you make financial choices.</li></ul>",
          "order_index": 6,
          "practice_question": "How much would you save in 4 years by cutting $20/month wasteful spending?",
          "practice_type": "text",
          "correct_answer": "$960"
        },
        {
          "title": "Day 7: Project Presentation and Future Applications",
          "content": "<h1>Project Presentation and Future Applications</h1><h3>Topic Overview</h3><ul><li>Present your project results: top discoveries, AI tool used, and what you learned.</li><li>Understand how AI can shape your financial future and career possibilities.</li></ul><h3>Explanation</h3><ul><li>Structure your presentation with an opening hook, methodology, key findings, AI recommendations, and future plans.</li><li>Example insights: weekend spending spikes, recurring subscriptions, payment method effects.</li><li>Discuss how AI combined with human judgment is the winning approach.</li></ul><h3>Key Takeaways</h3><ul><li>AI amplifies human reasoning but doesn’t replace it.</li><li>Data-driven choices lead to smarter money management.</li><li>Financial and AI skills are important for future success.</li></ul>",
          "order_index": 7,
          "practice_question": "Should you always follow AI recommendations without question?",
          "practice_type": "text",
          "correct_answer": "No"
        }
      ]
    },
    {
      "title": "Module 4: Taxation in India",
      "description": "Learn income tax basics (slabs, PAN, ITR) and GST (how businesses collect & pay).",
      "is_free": false,
      "order_index": 4,
      "subtopics": [
        {
          "title": "Day 1: Introduction to Taxation & PAN",
          "content": "<h1>Introduction to Taxation & PAN</h1><h2>Explanation</h2><p>Taxes finance roads, schools, and public services—like a club fee for the country.</p><p>PAN: A unique 10-character number for tracking financial activities.</p><p>PAN is needed for jobs, bank accounts, and big purchases.</p><h2>Key Takeaways</h2><ul><li>Taxes help build the nation.</li><li>PAN is your financial identity.</li><li>Everyone pays taxes in daily life.</li></ul>",
          "order_index": 1,
          "practice_question": "What is PAN’s full form?",
          "practice_type": "text",
          "correct_answer": "Permanent Account Number."
        },
        {
          "title": "Day 2: Income Tax Slabs & Calculation",
          "content": "<h1>Income Tax Slabs & Calculation</h1><h2>Explanation</h2><p>Income tax: Paid on money earned (salaries, business, gifts).</p><p>Slabs: The more you earn, the higher the tax rate.</p><p>Example: Up to ₹4 lakh = no tax; ₹4–8 lakh = 5%; above ₹24 lakh = 30%.</p><h2>Key Takeaways</h2><ul><li>Tax rates depend on income level.</li><li>Deductions can lower your taxable income.</li><li>Calculating tax helps plan spending.</li></ul>",
          "order_index": 2,
          "practice_question": "What income level pays zero tax?",
          "practice_type": "text",
          "correct_answer": "Up to ₹4 lakh (as per the example)."
        },
        {
          "title": "Day 3: All About ITR (Income Tax Return)",
          "content": "<h1>All About ITR (Income Tax Return)</h1><h2>Explanation</h2><p>ITR is like an annual report card for your income.</p><p>Filing ITR helps claim refunds and build financial history.</p><p>Forms vary (ITR-1 for salary, ITR-3 for business).</p><h2>Key Takeaways</h2><ul><li>Filing ITR is a legal duty.</li><li>Correct form choice is important.</li><li>Early ITR experience helps with future jobs and loans.</li></ul>",
          "order_index": 3,
          "practice_question": "What is Form 16?",
          "practice_type": "text",
          "correct_answer": "It's a certificate from an employer that TDS has been deducted and deposited with the authorities."
        },
        {
          "title": "Day 4: GST Basics",
          "content": "<h1>GST Basics</h1><h2>Explanation</h2><p>GST is a single, unified tax on goods/services, replacing older taxes.</p><p>Paid every time something is bought or sold.</p><p>Example: Buying a phone, GST is added to the bill.</p><h2>Key Takeaways</h2><ul><li>GST makes prices transparent.</li><li>Businesses register and collect GST for the government.</li><li>Different GST types handle state/national sales.</li></ul>",
          "order_index": 4,
          "practice_question": "What does GST stand for?",
          "practice_type": "text",
          "correct_answer": "Goods and Services Tax."
        },
        {
          "title": "Day 5: GST in Daily Life",
          "content": "<h1>GST in Daily Life</h1><h2>Explanation</h2><p>Essentials (milk/books) have low/no GST; luxuries (cars) have higher GST.</p><p>Businesses pay GST, but get credits for GST paid on purchases.</p><p>Check your next shopping bill for GST details.</p><h2>Key Takeaways</h2><ul><li>GST affects the cost of daily goods.</li><li>Businesses file GST returns, like homework for shopkeepers!</li><li>Input credit prevents “tax on tax.”</li></ul>",
          "order_index": 5,
          "practice_question": "What’s an Input Tax Credit?",
          "practice_type": "text",
          "correct_answer": "It allows businesses to subtract the tax they paid on inputs from the tax they collect on outputs."
        },
        {
          "title": "Day 6: Project—Prepare a Dummy ITR",
          "content": "<h1>Project—Prepare a Dummy ITR</h1><h2>Explanation</h2><p>Collect salary/slip, savings bank interest, investment proofs.</p><p>Calculate gross income, deductions, taxable income.</p><p>Simulate filling an ITR form.</p><h2>Key Takeaways</h2><ul><li>Filing ITR is systematic and easy with organized records.</li><li>Deductions help lower tax.</li><li>Practice prepares for real-life taxation.</li></ul>",
          "order_index": 6,
          "practice_question": "What documents do you need for ITR?",
          "practice_type": "text",
          "correct_answer": "Salary slip, savings bank interest statements, investment proofs."
        },
        {
          "title": "Day 7: GST Practical—Bill Audit",
          "content": "<h1>GST Practical—Bill Audit</h1><h2>Explanation</h2><p>Go through bills (internet, groceries, movie tickets).</p><p>For each, note GST rate, amount paid.</p><p>Simulate a month’s GST record for a small shop.</p><h2>Key Takeaways</h2><ul><li>Checking bills shows GST in daily life.</li><li>Understanding GST helps spot mistakes.</li><li>Practice running a GST record teaches business basics.</li></ul>",
          "order_index": 7,
          "practice_question": "Why is GST important for the government?",
          "practice_type": "text",
          "correct_answer": "It's a major source of revenue that helps fund public services and infrastructure."
        }
      ]
    },
    {
      "title": "Module 5: Entrepreneurship & Startups",
      "description": "Learn to validate ideas, use the business model canvas, and understand costing, pricing, and profit margins.",
      "is_free": false,
      "order_index": 5,
      "subtopics": [
        {
          "title": "Day 1: What Is Entrepreneurship?",
          "content": "<h1>What Is Entrepreneurship?</h1><h3>Topic Overview</h3><ul><li>The difference between a business owner and an entrepreneur</li><li>Why creativity and risk-taking matter</li><li>Stories of young entrepreneurs</li></ul><h3>Explanation</h3><p>Entrepreneurs search for new ideas to solve real problems.</p><p>Example: A student creates an app to help classmates buy lunch quickly.</p><p>Unlike regular business owners, entrepreneurs create something new.</p><h3>Key Takeaways</h3><ul><li>Entrepreneurs are creative problem solvers.</li><li>Innovation means making something better or new.</li><li>Teenagers can be successful entrepreneurs.</li></ul>",
          "order_index": 1,
          "practice_question": "Write down two problems from your daily life that annoy you.",
          "practice_type": "text",
          "correct_answer": "Answers will vary but should identify two distinct problems from daily experience."
        },
        {
          "title": "Day 2: Idea Validation",
          "content": "<h1>Idea Validation</h1><h3>Topic Overview</h3><ul><li>What “validation” means in startups</li><li>Why most businesses fail: building something nobody wants</li><li>Validation through interviews, surveys, and “fake doors”</li></ul><h3>Explanation</h3><p>Validation checks if real people want the idea BEFORE making it.</p><p>Teen example: Ask classmates if they’d use a new lunch app—don't build it until they say “yes!”</p><p>Use simple surveys and open questions to test interest.</p><h3>Key Takeaways</h3><ul><li>Validate before you build.</li><li>Talk with future customers.</li><li>Only pursue ideas that solve a real, shared problem.</li></ul>",
          "order_index": 2,
          "practice_question": "Interview three people about one of your ideas.",
          "practice_type": "text",
          "correct_answer": "Answers will vary but should reflect feedback from three individuals on a specific idea."
        },
        {
          "title": "Day 3: Business Model Canvas",
          "content": "<h1>Business Model Canvas</h1><h3>Topic Overview</h3><ul><li>The business model canvas: mapping your idea on one page</li><li>Key blocks: Customers, Value, Revenue, Costs, Channels</li><li>Example using a popular youth business</li></ul><h3>Explanation</h3><p>A canvas is like a “game plan” for a startup.</p><p>Fill sections such as “Who are my customers?” and “How will I make money?”</p><p>Example: A tutoring service’s canvas lists students as customers, teachers as partners, flyers/social as marketing.</p><h3>Key Takeaways</h3><ul><li>Every business needs a plan.</li><li>The canvas helps spot what is missing or unclear.</li><li>Real examples make planning easier.</li></ul>",
          "order_index": 3,
          "practice_question": "Use a worksheet to complete your own canvas for one idea.",
          "practice_type": "text",
          "correct_answer": "Answers will vary but should demonstrate a basic attempt to fill out the business model canvas sections."
        },
        {
          "title": "Day 4: Costing – What Does It Take To Start?",
          "content": "<h1>Costing – What Does It Take To Start?</h1><h3>Topic Overview</h3><ul><li>Startup costs: One-time vs. monthly</li><li>Cost categories: Materials, marketing, tech, legal</li><li>Sample calculations for small teen businesses</li></ul><h3>Explanation</h3><p>List everything you need to buy (laptop, website, marketing flyers, supplies).</p><p>Real examples: A jewelry business spends ₹500 on supplies, ₹100 on packaging.</p><p>Tracking costs avoids surprise debt.</p><h3>Key Takeaways</h3><ul><li>Every business has costs, even if you work from home.</li><li>Know start-up costs vs. everyday running expenses.</li><li>Cost planning helps you avoid overspending.</li></ul>",
          "order_index": 4,
          "practice_question": "List all items needed for your business idea.",
          "practice_type": "text",
          "correct_answer": "Answers will vary but should be a list of potential costs for a specific business idea."
        },
        {
          "title": "Day 5: Pricing Strategies",
          "content": "<h1>Pricing Strategies</h1><h3>Topic Overview</h3><ul><li>How much should you charge?</li><li>Different pricing methods: cost-plus, competitive, value-based</li><li>Common mistakes and tips for smart pricing</li></ul><h3>Explanation</h3><p>Cost-plus: Add a profit to your real costs—simple but risky.</p><p>Competitive: Research what others charge; set your price close or slightly lower.</p><p>Value-based: If you offer a unique solution, set a price based on what people think it’s worth, not just your cost.</p><h3>Key Takeaways</h3><ul><li>Don’t just guess—research and test pricing.</li><li>Pricing too low can hurt profits; too high loses customers.</li><li>Try different prices and ask classmates what they would pay.</li></ul>",
          "order_index": 5,
          "practice_question": "Calculate costs for making one product or delivering one service.",
          "practice_type": "text",
          "correct_answer": "Answers will vary but should show a calculation of per-unit cost."
        },
        {
          "title": "Day 6: Profit Margins",
          "content": "<h1>Profit Margins</h1><h3>Topic Overview</h3><ul><li>What is profit margin?</li><li>Margins in practice—what’s “good”?</li><li>How to increase margins: cutting costs, raising prices, adding value</li></ul><h3>Explanation</h3><p>Profit margin = (Price – Cost) ÷ Price × 100%</p><p>Example: Product costs ₹500, sells for ₹700 → margin = ₹200 ÷ ₹700 × 100 = ~29%</p><p>Lower costs or higher prices = better margins. But always balance with customer expectations!</p><h3>Key Takeaways</h3><ul><li>Good margins for startups are typically 20–40%.</li><li>Monitor costs regularly; don’t race competitors to the lowest price.</li><li>Invest in quality and unique value.</li></ul>",
          "order_index": 6,
          "practice_question": "Calculate the profit margin on your business idea.",
          "practice_type": "text",
          "correct_answer": "Answers will vary but should apply the profit margin formula to their specific business idea's costs and prices."
        },
        {
          "title": "Day 7: Bringing It Together",
          "content": "<h1>Bringing It Together</h1><h3>Topic Overview</h3><ul><li>Crafting your simple pitch: problem, solution, market, pricing, margin</li><li>Presenting your business plan</li><li>Getting feedback and next steps</li></ul><h3>Explanation</h3><p>Your pitch should include what problem you’re solving, who needs it, how you’ll market, your prices, and your growth goals.</p><p>Practice with family, friends, or class—use feedback to improve!</p><h3>Key Takeaways</h3><ul><li>Clear, confident pitches attract interest and support.</li><li>Real feedback helps refine ideas.</li><li>Every business evolves—don’t be afraid to adjust.</li></ul>",
          "order_index": 7,
          "practice_question": "Write out your pitch (max two minutes).",
          "practice_type": "text",
          "correct_answer": "Answers will vary but should be a short, structured pitch for their business idea."
        }
      ]
    }
  ]
}
